zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_cortex.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_cortex.h
  * @author  MCD Application Team
  * @brief   Header file of CORTEX LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The LL CORTEX driver contains a set of generic APIs that can be
    used by user:
      (+) SYSTICK configuration used by @ref LL_mDelay and @ref LL_Init1msTick with
           HCLK source or @ref LL_Init1msTick_HCLK_Div8, @ref LL_Init1msTick_LSI or
           @ref LL_Init1msTick_LSE with external source
      (+) Low power mode configuration (SCB register of Cortex-MCU)
      (+) API to access to MCU info (CPUID register)
      (+) API to enable fault handler (SHCSR accesses)
      (+) API to enable and disable the MPU secure and non-secure
      (+) API to configure the region of MPU secure and non-secure
      (+) API to configure the attributes region of MPU secure and non-secure

  @endverbatim
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP2xx_LL_CORTEX_H
#define __STM32MP2xx_LL_CORTEX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx.h"

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

/** @defgroup CORTEX_LL CORTEX
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup CORTEX_LL_Exported_Constants CORTEX LL Exported Constants
  * @{
  */

/** @defgroup CORTEX_LL_EC_CLKSOURCE_HCLK SYSTICK Clock Source
  * @{
  */
#define LL_SYSTICK_CLKSOURCE_EXTERNAL      0x00000000U                 /*!< External clock source selected as SysTick
                                                                            clock source */
#define LL_SYSTICK_CLKSOURCE_HCLK          SysTick_CTRL_CLKSOURCE_Msk  /*!< AHB clock selected as SysTick
                                                                            clock source */
/** Legacy definitions for backward compatibility purpose
  */
#define LL_SYSTICK_CLKSOURCE_HCLK_DIV8    LL_SYSTICK_CLKSOURCE_EXTERNAL
/**
  */
/**
  * @}
  */

#if !defined(CORE_CM0PLUS)
/** @defgroup CORTEX_LL_EC_FAULT Handler Fault type
  * @{
  */
#define LL_HANDLER_FAULT_USG               SCB_SHCSR_USGFAULTENA_Msk              /*!< Usage fault */
#define LL_HANDLER_FAULT_BUS               SCB_SHCSR_BUSFAULTENA_Msk              /*!< Bus fault */
#define LL_HANDLER_FAULT_MEM               SCB_SHCSR_MEMFAULTENA_Msk              /*!< Memory management fault */
#define LL_HANDLER_FAULT_SECURE            SCB_SHCSR_SECUREFAULTENA_Msk           /*!< Secure fault */
/**
  * @}
  */
#endif /* !defined(CORE_CM0PLUS) */

#if __MPU_PRESENT
/* [MPU/CONSTANTS] M0+ (ARMv6-M) / M33 (ARMv8-M) common definitions */
/* Register MPU_CTRL */
/** @defgroup CORTEX_LL_MPU_HFNMI_PRIVDEF_Control CORTEX LL MPU HFNMI and PRIVILEGED Access control
  * @{
  */
#define LL_MPU_CTRL_HFNMI_PRIVDEF_NONE     0x00000000U                                       /*!< Disable NMI and privileged SW access */
#define LL_MPU_CTRL_HARDFAULT_NMI          MPU_CTRL_HFNMIENA_Msk                             /*!< Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers */
#define LL_MPU_CTRL_PRIVILEGED_DEFAULT     MPU_CTRL_PRIVDEFENA_Msk                           /*!< Enable privileged software access to default memory map */
#define LL_MPU_CTRL_HFNMI_PRIVDEF          (MPU_CTRL_HFNMIENA_Msk | MPU_CTRL_PRIVDEFENA_Msk) /*!< Enable NMI and privileged SW access */
/**
  * @}
  */

/* Register MPU_RBAR */
/** @defgroup CORTEX_LL_EC_REGION_INDEX CORTEX LL MPU Region Index
  * @{
  */
#define LL_MPU_REGION_NUMBER0              0x00U /*!< Region Index 0 */
#define LL_MPU_REGION_NUMBER1              0x01U /*!< Region Index 1 */
#define LL_MPU_REGION_NUMBER2              0x02U /*!< Region Index 2 */
#define LL_MPU_REGION_NUMBER3              0x03U /*!< Region Index 3 */
#define LL_MPU_REGION_NUMBER4              0x04U /*!< Region Index 4 */
#define LL_MPU_REGION_NUMBER5              0x05U /*!< Region Index 5 */
#define LL_MPU_REGION_NUMBER6              0x06U /*!< Region Index 6 */
#define LL_MPU_REGION_NUMBER7              0x07U /*!< Region Index 7 */
/* On MP2, Cortex-M33 MPU has got 16 secure and 16 non-secure regions */
#if defined(CORE_CM33)
#define LL_MPU_REGION_NUMBER8              0x08U /*!< Region Index 8 */
#define LL_MPU_REGION_NUMBER9              0x09U /*!< Region Index 9 */
#define LL_MPU_REGION_NUMBER10             0x0AU /*!< Region Index 10 */
#define LL_MPU_REGION_NUMBER11             0x0BU /*!< Region Index 11 */
#define LL_MPU_REGION_NUMBER12             0x0CU /*!< Region Index 12 */
#define LL_MPU_REGION_NUMBER13             0x0DU /*!< Region Index 13 */
#define LL_MPU_REGION_NUMBER14             0x0EU /*!< Region Index 14 */
#define LL_MPU_REGION_NUMBER15             0x0FU /*!< Region Index 15 */
#endif /* defined(CORE_CM33) */
/**
  * @}
  */

/* Register MPU_RASR (M0+) / MPU_RLAR (M33) */
/** @defgroup CORTEX_LL_MPU_Region_Enable CORTEX LL MPU Region Enable
  * @{
  */
#define LL_MPU_REGION_ENABLE               1U
#define LL_MPU_REGION_DISABLE              0U
/**
  * @}
  */

