zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_cortex.h
/* Register SCB_SCR_NS */
/**
  * @brief  Processor uses sleep as its low power mode
  * @rmtoll SCB_SCR_NS      SLEEPDEEP     LL_LPM_EnableSleep_NS
  * @retval None
  */
__STATIC_INLINE void LL_LPM_EnableSleep_NS(void)
{
  /* Clear SLEEPDEEP bit of non-secure Cortex System Control Register */
  CLEAR_BIT(SCB_NS->SCR, ((uint32_t)SCB_SCR_SLEEPDEEP_Msk));
}

/**
  * @brief  Processor uses deep sleep as its low power mode
  * @rmtoll SCB_SCR_NS      SLEEPDEEP     LL_LPM_EnableDeepSleep_NS
  * @retval None
  */
__STATIC_INLINE void LL_LPM_EnableDeepSleep_NS(void)
{
  /* Set SLEEPDEEP bit of non-secure Cortex System Control Register */
  SET_BIT(SCB_NS->SCR, ((uint32_t)SCB_SCR_SLEEPDEEP_Msk));
}

/**
  * @brief  Configures sleep-on-exit when returning from Handler mode to Thread mode.
  * @note   Setting this bit to 1 enables an interrupt-driven application
  *         to avoid returning to an empty main application.
  * @rmtoll SCB_SCR_NS      SLEEPONEXIT   LL_LPM_EnableSleepOnExit_NS
  * @retval None
  */
__STATIC_INLINE void LL_LPM_EnableSleepOnExit_NS(void)
{
  /* Set SLEEPONEXIT bit of non-secure Cortex System Control Register */
  SET_BIT(SCB_NS->SCR, ((uint32_t)SCB_SCR_SLEEPONEXIT_Msk));
}

/**
  * @brief  Do not sleep when returning to Thread mode.
  * @rmtoll SCB_SCR_NS      SLEEPONEXIT   LL_LPM_DisableSleepOnExit_NS
  * @retval None
  */
__STATIC_INLINE void LL_LPM_DisableSleepOnExit_NS(void)
{
  /* Clear SLEEPONEXIT bit of non-secure Cortex System Control Register */
  CLEAR_BIT(SCB_NS->SCR, ((uint32_t)SCB_SCR_SLEEPONEXIT_Msk));
}

/**
  * @brief  Enabled events and all interrupts, including disabled interrupts,
  *         can wakeup the processor.
  * @rmtoll SCB_SCR_NS      SEVONPEND    LL_LPM_EnableEventOnPend_NS
  * @retval None
  */
__STATIC_INLINE void LL_LPM_EnableEventOnPend_NS(void)
{
  /* Set SEVONPEND bit of non-secure Cortex System Control Register */
  SET_BIT(SCB_NS->SCR, ((uint32_t)SCB_SCR_SEVONPEND_Msk));
}

/**
  * @brief  Only enabled interrupts or events can wakeup the processor,
  *         disabled interrupts are excluded
  * @rmtoll SCB_SCR_NS      SEVONPEND    LL_LPM_DisableEventOnPend_NS
  * @retval None
  */
__STATIC_INLINE void LL_LPM_DisableEventOnPend_NS(void)
{
  /* Clear SEVONPEND bit of non-secure Cortex System Control Register */
  CLEAR_BIT(SCB_NS->SCR, ((uint32_t)SCB_SCR_SEVONPEND_Msk));
}
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */


/**
  * @}
  */
/* On Cortex-M33 only */
#if !defined(CORE_CM0PLUS)
/** @defgroup CORTEX_LL_EF_HANDLER CORTEX LL HANDLER
  * @{
  */
/***********************************/
/* M33 (ARMv8-M) HANDLER functions */
/***********************************/
/* Register SCB_SHCSR */
/**
  * @brief  Enable a fault in System handler control register (SHCSR)
  * @rmtoll SCB_SHCSR    USGFAULTENA     LL_HANDLER_EnableFault\n
  *         SCB_SHCSR    BUSFAULTENA     LL_HANDLER_EnableFault\n
  *         SCB_SHCSR    MEMFAULTENA     LL_HANDLER_EnableFault\n
  *         SCB_SHCSR    SECUREFAULTENA  LL_HANDLER_EnableFault
  * @param  Fault This parameter can be a combination of the following values:
  *         @arg @ref LL_HANDLER_FAULT_USG
  *         @arg @ref LL_HANDLER_FAULT_BUS
  *         @arg @ref LL_HANDLER_FAULT_MEM
  *         @arg @ref LL_HANDLER_FAULT_SECURE (*)
  *
  *         (*) value applicable in secure when the system implements the security.
  * @retval None
  */
__STATIC_INLINE void LL_HANDLER_EnableFault(uint32_t Fault)
{
  /* Enable the system handler fault */
  SET_BIT(SCB->SHCSR, Fault);
}

/**
  * @brief  Disable a fault in System handler control register (SHCSR)
  * @rmtoll SCB_SHCSR    USGFAULTENA     LL_HANDLER_DisableFault\n
  *         SCB_SHCSR    BUSFAULTENA     LL_HANDLER_DisableFault\n
  *         SCB_SHCSR    MEMFAULTENA     LL_HANDLER_DisableFault\n
  *         SCB_SHCSR    SECUREFAULTENA  LL_HANDLER_DisableFault
  * @param  Fault This parameter can be a combination of the following values:
  *         @arg @ref LL_HANDLER_FAULT_USG
  *         @arg @ref LL_HANDLER_FAULT_BUS
  *         @arg @ref LL_HANDLER_FAULT_MEM
  *         @arg @ref LL_HANDLER_FAULT_SECURE (*)
  *
  *         (*) value applicable in secure when the system implements the security.
  * @retval None
  */
__STATIC_INLINE void LL_HANDLER_DisableFault(uint32_t Fault)
{
  /* Disable the system handler fault */
  CLEAR_BIT(SCB->SHCSR, Fault);
}

/*******************************************/
/* M33 (ARMv8-M) HANDLER secure functions */
/*******************************************/
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/* Register SCB_SHCSR_NS */
/**
  * @brief  Enable a fault in non-secure System handler control register (SHCSR)
  * @rmtoll SCB_SHCSR_NS    USGFAULTENA     LL_HANDLER_EnableFault_NS\n
  *         SCB_SHCSR_NS    BUSFAULTENA     LL_HANDLER_EnableFault_NS\n
  *         SCB_SHCSR_NS    MEMFAULTENA     LL_HANDLER_EnableFault_NS
  * @param  Fault This parameter can be a combination of the following values:
  *         @arg @ref LL_HANDLER_FAULT_USG
  *         @arg @ref LL_HANDLER_FAULT_BUS
  *         @arg @ref LL_HANDLER_FAULT_MEM
  *
  * @retval None
  */
__STATIC_INLINE void LL_HANDLER_EnableFault_NS(uint32_t Fault)
{
  /* Enable the non-secure system handler fault */
  SET_BIT(SCB_NS->SHCSR, Fault);
}

/**
  * @brief  Disable a fault in non-secure System handler control register (SHCSR)
  * @rmtoll SCB_SHCSR_NS    USGFAULTENA     LL_HANDLER_DisableFault_NS\n
  *         SCB_SHCSR_NS    BUSFAULTENA     LL_HANDLER_DisableFault_NS\n
  *         SCB_SHCSR_NS    MEMFAULTENA     LL_HANDLER_DisableFault_NS
  * @param  Fault This parameter can be a combination of the following values:
  *         @arg @ref LL_HANDLER_FAULT_USG
  *         @arg @ref LL_HANDLER_FAULT_BUS
  *         @arg @ref LL_HANDLER_FAULT_MEM
  *
  * @retval None
  */
__STATIC_INLINE void LL_HANDLER_DisableFault_NS(uint32_t Fault)
{
  /* Disable the non-secure system handler fault */
  CLEAR_BIT(SCB_NS->SHCSR, Fault);
}
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @}
  */
#endif /* !defined(CORE_CM0PLUS) */

/** @defgroup CORTEX_LL_EF_MCU_INFO CORTEX LL MCU INFO
  * @{
  */
/***********************************************************/
/* M0+ (ARMv6-M) / M33 (ARMv8-M) MCU INFO common functions */
/***********************************************************/
/* Register SCB_CPUID */
/**
  * @brief  Get Implementer code
  * @rmtoll SCB_CPUID    IMPLEMENTER   LL_CPUID_GetImplementer
  * @retval Value should be equal to 0x41 for ARM
  */
__STATIC_INLINE uint32_t LL_CPUID_GetImplementer(void)
{
  return (uint32_t)(READ_BIT(SCB->CPUID, SCB_CPUID_IMPLEMENTER_Msk) >> SCB_CPUID_IMPLEMENTER_Pos);
}

/**
  * @brief  Get Variant number (The r value in the rnpn product revision identifier)
  * @rmtoll SCB_CPUID    VARIANT       LL_CPUID_GetVariant
  * @retval Value between 0 and 255
  */
__STATIC_INLINE uint32_t LL_CPUID_GetVariant(void)
{
  return (uint32_t)(READ_BIT(SCB->CPUID, SCB_CPUID_VARIANT_Msk) >> SCB_CPUID_VARIANT_Pos);
}

/* Cortex-M33 (ARMv8-M) case */
#if !defined(CORE_CM0PLUS)
/**
  * @brief  Get Architecture version
  * @rmtoll SCB_CPUID    ARCHITECTURE  LL_CPUID_GetArchitecture
  * @retval Value should be equal to 0xF for Cortex-M33 ("ARMv8-M with Main Extension")
  */
/* Cortex-M0+ (ARMv6-M) case */
#else /* !defined(CORE_CM0PLUS) */
/**
  * @brief  Get Architecture version
  * @rmtoll SCB_CPUID    ARCHITECTURE  LL_CPUID_GetArchitecture
  * @retval Value should be equal to 0xC for Cortex-M0+ ("ARMv6-M")
  */
#endif /* !defined(CORE_CM0PLUS) */
__STATIC_INLINE uint32_t LL_CPUID_GetArchitecture(void)
{
  return (uint32_t)(READ_BIT(SCB->CPUID, SCB_CPUID_ARCHITECTURE_Msk) >> SCB_CPUID_ARCHITECTURE_Pos);
}

/* Cortex-M33 case */
#if !defined(CORE_CM0PLUS)
/**
  * @brief  Get Part number
  * @rmtoll SCB_CPUID    PARTNO        LL_CPUID_GetParNo
  * @retval Value should be equal to 0xD21 for Cortex-M33
  */
/* Cortex-M0+ (ARMv6-M) case */
#else /* !defined(CORE_CM0PLUS) */
/**
  * @brief  Get Part number
  * @rmtoll SCB_CPUID    PARTNO        LL_CPUID_GetParNo
  * @retval Value should be equal to 0xC20 for Cortex-M0+
  */
#endif /* !defined(CORE_CM0PLUS) */
__STATIC_INLINE uint32_t LL_CPUID_GetParNo(void)
{
  return (uint32_t)(READ_BIT(SCB->CPUID, SCB_CPUID_PARTNO_Msk) >> SCB_CPUID_PARTNO_Pos);
}

/**
  * @brief  Get Revision number (The p value in the rnpn product revision identifier, indicates patch release)
  * @rmtoll SCB_CPUID    REVISION      LL_CPUID_GetRevision
  * @retval Value between 0 and 255
  */
__STATIC_INLINE uint32_t LL_CPUID_GetRevision(void)
{
  return (uint32_t)(READ_BIT(SCB->CPUID, SCB_CPUID_REVISION_Msk) >> SCB_CPUID_REVISION_Pos);
}

